sample-soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adr="http://ljcomputing.net/address">
    <soapenv:Header/>
    <soapenv:Body>
        <adr:submitAddressRecordsRequest>
            <addresses>
                <address>
                    <name>James G Willmore</name>
                    <address1>832 Savitt Place</address1>
                    <address2></address2>
                    <city>Union</city>
                    <state>NJ</state>
                    <zip>07083</zip>
                    <zip4>6710</zip4>
                </address>
                <address>
                    <name>Lynn E Pinard-Willmore</name>
                    <address1>832 Savitt Place</address1>
                    <address2></address2>
                    <city>Union</city>
                    <state>NJ</state>
                    <zip>07083</zip>
                    <zip4>6710</zip4>
                </address>
            </addresses>
        </adr:submitAddressRecordsRequest>
    </soapenv:Body>
</soapenv:Envelope>
